public/blog/qemu/qemu-chroot-into-an-img-file/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Qemu Chroot Into an Img File</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Qemu Chroot Into an Img File</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Qemu Chroot Into an Img File</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Mounting the image</a>
<ul>
<li><a href="#headline-4">Explanation of the task</a>
</li>
<li><a href="#headline-5">Getting Starting Sector</a>
</li>
<li><a href="#headline-6">Mounting the IMG</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Qemu Chroot Into an Img File
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Directions for mounting an IMG file in Linux. Tested with Raspbian ARM</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Mounting the image
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Explanation of the task
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>IMG files found in arm images are complete disk dumps made to a file. The IMG
file will contain all of the partition information, just as you&#39;d see it if
running <code>dd if=/dev/sda bs=4K | cat</code></p>
<p>
The mount command allows you to pass the exact start and end sectors you&#39;d like
to mount. Using this, we will mount the start and end of our partition inside
the img file.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Getting Starting Sector
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
The output of this command will contain the start and end sectors of each
partition. You can tell which partition is your IMG file&#39;s root partition by
comparing the sizes. Larger typically means root.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>fdisk -l file.img
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">[</span>...<span style="color:#f92672">]</span>
</span></span><span style="display:flex;"><span>Units: sectors of <span style="color:#ae81ff">1</span> * 512 <span style="color:#f92672">=</span> <span style="color:#ae81ff">512</span> bytes
</span></span><span style="display:flex;"><span><span style="color:#f92672">[</span>...<span style="color:#f92672">]</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Device                                    Boot  Start     End Sectors  Size Id Type
</span></span><span style="display:flex;"><span>2021-05-07-raspios-buster-armhf-lite.img1        <span style="color:#ae81ff">8192</span>  <span style="color:#ae81ff">532479</span>  <span style="color:#ae81ff">524288</span>  256M  c W95 FAT32 <span style="color:#f92672">(</span>LBA<span style="color:#f92672">)</span>
</span></span><span style="display:flex;"><span>2021-05-07-raspios-buster-armhf-lite.img2      <span style="color:#ae81ff">532480</span> <span style="color:#ae81ff">3661823</span> <span style="color:#ae81ff">3129344</span>  1.5G <span style="color:#ae81ff">83</span> Linux</span></span></code></pre></div>
</div>
<p>
My root partition starts on sector 532480. This is a logical sector offset. It&#39;s
a way to identify where this partition starts on a disk. What I need is the
exact starting and ending byte instead. We have to convert the logical sector
offset into a byte offset.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Mounting the IMG
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Multiply the start sector (532480) by the sector size (512). I&#39;m using bash
syntax to accomplish this.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>mount -o loop,offset<span style="color:#f92672">=</span><span style="color:#66d9ef">$((</span><span style="color:#ae81ff">512</span><span style="color:#f92672">*</span><span style="color:#ae81ff">532480</span><span style="color:#66d9ef">))</span>,rw
</span></span><span style="display:flex;"><span>~/2021-05-07-raspios-buster-armhf-lite.img /mnt</span></span></code></pre></div>
</div>
<p>
This will mount the drive. Since the partition partition, I don&#39;t have to worry
about specifying the ending offset.</p>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
